; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image2 - mode
	thermograph1 - mode
	spectrograph0 - mode
	GroundStation2 - direction
	GroundStation4 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation1 - direction
	Star6 - direction
	Star3 - direction
	GroundStation0 - direction
	Star5 - direction
	GroundStation7 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star6)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star6)
	(supports instrument2 image2)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation9)
)
(:goal (and
	(have_image Phenomenon10 spectrograph0)
	(have_image Star11 image2)
	(have_image Planet12 thermograph1)
	(have_image Phenomenon13 image2)
	(have_image Star14 image2)
	(have_image Star15 spectrograph0)
))

)

; plan
1. (turn_to satellite0 groundstation1 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 planet12 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet12)
   goals met: 0 of 6
5. (take_image satellite0 planet12 instrument0 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon13 instrument0 image2)
   added: (have_image phenomenon13 image2)
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 6
9. (take_image satellite0 phenomenon10 instrument0 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 3 of 6
10. (turn_to satellite0 star11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star11)
   goals met: 3 of 6
11. (take_image satellite0 star11 instrument0 image2)
   added: (have_image star11 image2)
   goals met: 4 of 6
12. (turn_to satellite0 star14 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star14)
   goals met: 4 of 6
13. (take_image satellite0 star14 instrument0 image2)
   added: (have_image star14 image2)
   goals met: 5 of 6
14. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 5 of 6
15. (take_image satellite0 star15 instrument0 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 6 of 6
